
Console.Clear();

// Задача 1: Задайте одномерный массив из 10 целых чисел от 1 до 100. Найдите количество элементов массива,
//значения которых лежат в отрезке [20,90].

// Console.Write("Введите кол-во элементов массива: ");
// int n = Convert.ToInt32(Console.ReadLine());;
// int[] array = new int[n];
// for(int i = 0; i < array.Length; i++)
//     array[i] = new Random().Next(1, 101);
// Console.WriteLine(string.Join(", ", array));

// int result = 0;
// for(int i = 0; i < array.Length; i++)
// if(array[i] <= 90 && array[i] >= 20)
// result++;
// Console.WriteLine(result);

//Задача 2: Задайте массив на 10 целых чисел. Напишите программу, которая определяет количество чётных чисел в массиве.

// Console.Write("Введите кол-во элементов: ");
// int n = Convert.ToInt32(Console.ReadLine());
// int[] array = new int[n];
// for(int i = 0; i < array.Length; i++)
//     array[i] = new Random().Next(1, 101);
// Console.WriteLine(string.Join(", ", array));

// int result = 0;
// for(int i = 0; i < array.Length; i++)
// if(array[i] % 2 == 0)
// result++;
// Console.WriteLine($"Количество четных чисел: {result}");